app/controllers/buildings_controller.rb

SELECT * FROM `buildings`
---
  def index
    @buildings = Building.all

DELETE FROM `buildings` WHERE `id` = 135138680
---
  def destroy
    @building.destroy

SELECT * FROM `buildings` WHERE (`buildings`.`id` = 135138680)
---
    def set_building
      @building = Building.find(params[:id])