app/controllers/courses_controller.rb

SELECT * FROM `courses` LIMIT 1
---
  def index
    @courses = Course.all

UPDATE `courses` SET `updated_at` = '2010-01-28 03:56:45', `name` = 'CST 533, Yo!' WHERE `id` = 969140272
---
  def update
    respond_to do |format|
      if @course.update(course_params)

SELECT * FROM `courses` WHERE (`courses`.`id` = 969140272)
---
    def set_course
      @course = Course.find(params[:id])