app/controllers/instructors_controller.rb

    def set_instructor
      @instructor = Instructor.find(params[:id])
---
SELECT * FROM `instructors` WHERE (`instructors`.`id` = 398189615)