app/controllers/rooms_controller.rb

    def set_room
      @room = Room.find(params[:id])
---
SELECT * FROM `rooms` WHERE (`rooms`.`id` = 387675712)