app/controllers/semesters_controller.rb

SELECT * FROM `semesters`
---
  def index
    @semesters = Semester.all

SELECT * FROM "semesters" WHERE ("semesters"."id" = 9726580)
---
    def set_semester
      @semester = Semester.find(params[:id])