app/controllers/students_controller.rb

    def set_student
      @student = Student.find(params[:id])
---
SELECT * FROM `students` WHERE (`students`.`id` = 919034166)